Тест1/src/Documents/РасходыНовые/РасходыНовые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходыНовые</name>
  <registerRecords>AccumulationRegister.ЛичныеРасходы</registerRecords>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Остаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кому</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>CatalogRef.ВидыРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест1/src/Documents/РасходыНовые/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодсчетОстатка()	
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетОстатка()
	Объект.Остаток = Объект.Сумма;
	Объект.Остаток = Объект.Остаток - ПодсчетПоТаблице();	
КонецПроцедуры

&НаСервере
Функция ПодсчетПоТаблице()
	СуммаПоТаблице = 0;
	Для Каждого Строка Из Объект.Таблица Цикл
		СуммаПоТаблице = СуммаПоТаблице + Строка.Сумма;
	КонецЦикла;
	Возврат СуммаПоТаблице; 
КонецФункции


&НаКлиенте
Процедура ТаблицаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодсчетОстатка();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ПодсчетОстатка();
КонецПроцедуры
